Repository: mozilla-l10n/mt-training-data
Catalog: giz/giz_pontoon.tmx
Source language: en_us
Languages: giz

source: Start recording
giz: Zla ja ay

source: <strong>[Crackle]</strong> giant dinosaurs of <strong>[crackle]</strong> -riassic.
giz: </strong> [wus ngi ngwat ]</strong> dirlengeƞ'hey madidiɗahay ngi <strong>[ wus ngi ngwat ] </strong> -rias

source: <strong>[Sneeze]</strong> The giant dinosaurs of the <strong>[cough]</strong> Triassic.
giz: <strong>[wus ngi ngwat ] </strong> Dirlengeƞ'hey madidiɗahay ngi <strong>[ irsle]</strong> Trias

source: Submit
giz: Slin di

source: Submit a new question for the community to read and respond to
giz: Vuloh cufuɗ nawaya ɓa jum ngi mizli a slufaka waɗ a zilam mi

source: Submit a report
giz: Slin ti rapor

source: Submit clips
giz: Slinoko ti jihey

source: Submit new questions for the community to read and respond to
giz: Vulo cufuɗoy nawayahay ɓa jum ngi mizliy a slufaka waɗ a zilam mi aƞga

source: Success
giz: A ndil le

source: success checkmark
giz: Guɗuk ngi sina tikinaƞ

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
giz: Ardi ti hazum ɓa hignaka ɓi vuna.Ardi ti gula ɓa hiziga. Ardi ti muƞ ɓa mɓuk <strong>. Ki piyik ti slin ngi zinga'a ngi mi hiri na ta! </strong>

source: Taking several attempts to read a word.
giz: Gaka/maka slif ngi mi purla sar haɗi

source: Tap
giz: Hirpa ar

source: Technology and Robotics
giz: sina diya gwat ati madiy gwat mi gidang hadahay

source: Thank you for contributing your bulk submission!
giz: sise asi vula vu dik tir slina ndra mingibi hada

source: Thank you for contributing your voice!
giz: Sise vur ay ɗik kami vuliy di na

source: Thank you for donating your voice clips!
giz: Sise vur vul ngi jihey mudumbuƞhoy!

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
giz: Sise vur jihey kumoy na!<lineBreak></lineBreak> wurenna tiɓaka waɗ ki slinam ti mificek hanay na

source: Thank you for your voice information
giz: Sise vur siney angi ay mijahay na

source: The bumblebee sped by.
giz: Malamba a ci le

source: The clip has disrespectful or offensive language.
giz: Ay mija ngi dumbuƞ na, naƞ ti mi malamba ati mi ɗongor

source: The giant dinosaur of the Triassic.
giz: Dirlengeƞ madiɗa ngi Trias

source: The giant dinosaurs of the Triassi-.
giz: Dirlengeƞ hey madiɗa hay ngi Tria

source: The giant dinosaurs of the Triassic.
giz: Dirlengeƞ'hey madiɗahay gi Trias

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
giz: Dirlengeƞ'hey madidiɗahay gi Trias.<strong> [ Ay gi mbur mudumbuƞ mi zila] </strong>

source: The giant dinosaurs of the Triassic. Yes.
giz: Dirlengeƞ hey madiɗa hay ngi Trias. Ka hana

source: The giant dino <strong>[cough]</strong> the Triassic.
giz: Dirlengeƞ madidiɗa <strong>[ irsle]</strong> ngi Trias

source: There are currently no sentences to review in this language.
giz: vurenna ɓi ngi cihile anta ar irne hana mata

source: The recording was too long.
giz: jinaƞ naƞ jek haɗa

source: The recording was too quiet.
giz: Hurum ngi jinaƞ naƞ meciɗek ƞwa

source: The recording was too short.
giz: jinaƞ naƞ digule haɗi

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
giz: Ay gi mizliye tan walwal a wuzla zil ati ngwas ma slif. Ɓa ki hizigaka ay a vra na, si kaɓa "volim" naƞ bok(ha muƞ) fine ay mi ja ti hinye-hinye. Malla bo naƞ a riwuy ƞwa(ɓwasl) ara tikukum gi cina ngwat mi jumom ko ne'e ati ɗerewel mi tuho

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
giz: mbur ma cikila bihey a slikid le ngar plateforme common Voice. Ki tuhu gu

source: The sentence has a grammatical or spelling error.
giz: Migiɓi vuna naƞ ti zlub gi ɓami ati tuh naƞ

source: The sentence has disrespectful or offensive language.
giz: Migiɓi hana vuna naƞ ti za vu aƞ gaƞ

source: The sentence must be grammatically correct.
giz: cihildarmi ngi be anja atir celele

source: The sentence must be speakable.
giz: anja slif ɓi atir ma ɓaka gu

source: The sentence must be spelled correctly.
giz: anja ɓi a ndir mi toho celele

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
giz: Sinehey ar ngwatay walwal vuna, da ki wuɗam ki jiɓoko tan na, da kum ar wuya. Da i bokole ti cikilamihey na, naɓa ndrada ɗumoko sinehey misi jilen ar ndra. I gaka na, anji slimiɗ , vi , zil malla ngwas hana gar a bawa jom ati "adrese" ta.

source: Three to go!
giz: Fine makir

source: Too many files
giz: jum ngi gwataya a gam hada

source: Transcribe audio recordings into text
giz: Ɗiya mbiɗi ay mija ar ɗerewel

source: Transcribe audio recordings in your language
giz: Ɓuɗa ay'hay mijahay tiƞ irne ɗik

source: Try again by dragging your file here
giz: maka hiri na va tir cah jum gwat kumoyo aka

source: Try uploading again
giz: maka slin nang ava ma

source: Understand contribution criteria
giz: Cina mi peslek ngi jini

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
giz: Cina ngwatay mi si anji i kam slimid aƞ taƞ. Da ira cinam mi mijataƞ ɓa gi wa dumbuƞ na, naɓa a sika mi kumoy vuna(mikum mi jakatan na)

source: Upload aborted. Do you want to delete your recordings?
giz: A ndil ta. Ki wuɗ ɓa ki susumuyoko jihey a vura kwa?

source: { $uploadedSentences } of { $totalSentences } sentences collected
giz: ɓehey mi jumohoy ar { $totalSentences }

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
giz: { $totalSentences } ɓehey mi jumohoy ar . wusa <downloadLink>here</downloadLink> ɓa ngi ja/ca ɓehey mi hizigataƞ.

source: Upload failed, please retry.
giz: a slin ta , maka ava

source: Upload <icon></icon> public domain sentences
giz: girjoko jum ngi gwat kumoyo <uploadButton> hiripa ba ngi slin di r</uploadButton>

source: Upload in progress...
giz: aro slin

source: Upload more sentences?
giz: slinam mingiɓi mekelemey?

source: Use correct grammar
giz: Cihildarmi anja naŋ circir

source: Use correct spelling and punctuation
giz: tuh ngi mihey ati cici waɗ muskavu nahay andja tang cicir

source: Validate Readings
giz: Tiɓi ngi slufoy

source: Validate Readings, Review Transcriptions
giz: Tiɓi ngi slufoy, cihil ngi ngwatay mi mbuɗahay

source: Validate Readings <small>(Coming soon)</small>
giz: Tiɓi ngi slufoy <small>(hiney masa soko)</small>

source: Validate readings submitted by community members
giz: Tiɓi slufoy misi jum ngi mizli mi slino tan

source: Validate user-recorded readings in your language
giz: Tiɓi ngi slufoy mi jahay ti migidi slrahay aƞ

source: Varying Pronunciations
giz: Zilhey ma cinam walwal

source: Volume
giz: Bi'ay

source: Want to save your information? <createProfile>Create a profile</createProfile>
giz: Ki wuɗ ki ja sin ɗikeye kwa?<createProfile> tuh buga vu/vidum ngi mbur</createProfile>

source: We are going out to get a coffee.
giz: ko kawana kwana li asa gi zuyo

source: We are going out to get coffee.
giz: Ko kawana kwana asa gi zuyo

source: We couldn’t get any audio clips for you to listen to. Please try again later.
giz: I lulam ay mi ja ki cin ta . Anji ki wa a dirba ne'e

source: We couldn’t get any sentences for you to speak. Please try again later.
giz: I lumam migiɓi ngi zil ma ta. Zuwen ki maka a dirba ne'e

source: We may have run out of clips - refresh the page, or try again later.
giz: Ndranta ti "ngwat mawaka gar ava" ngi tiɓi aƞ irne/mi hana

source: We’re going out to get coffee.
giz: Ko kawana asa gi zuyo

source: We're making some big changes
giz: ira mbuɗa ka le miduɓa

source: We’re sorry, your platform is not currently supported.
giz: Wereke,amma li ngi kiɗa slir ɗike a ci aka ta run

source: We've run out of sentences to record in this language...
giz: Ndra anta ti mi giɓi ngi ji ti mi hana ta

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
giz: Ngwatay ma jinikum ngi dubun na, ɓusaka hurumoy misi a ro'o. Ko hurumoy ma gam ti gidan kwana tuɓaka tan da anta tikukum ngi cina mi mitohohoy vuna gar. Da ko kaɓa "mizik" ara gi/zli ne'ne, tuɓaka naha kine. Amma da naƞ ha mun ɓa a tikukum ngi cin na, ki tuɓaka ta.

source: What issues are you experiencing with this sentence?
giz: Malamba wana kum mi lumam aƞ migiɓi hana kwa?

source: What needs to be in my file?
giz: gwat mudjumo du mi ara ka ?

source: What sentences can I add?
giz: i buc mingiɓi wanahay gukwa ?

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
giz: Da ki ra cinaka na, cingilaka kuy kuy. Da ay mija na naƞ kasla(misi purla) ati ay mutoho.Hizigaka a vra da zlub memeɗe ada aƞga.<br</. Zluɓoy memeɗehey ma moko ngwe ngwe tani

source: Why are you asking?
giz: Cufuɗ hana vur mike?

source: With a profile, you can keep track of your activity and connect with a community of voice data contributors.
giz: Ati vidum ɗike ki sipa slra kum ma gaka ati sukuy ngi jinihey aƞ jamihey walwal

source: Write
giz: tuhu

source: Write options menu
giz: Makaw ngi « tuh »

source: y
giz: h

source: Y
giz: H

source: Yes
giz: Hῖʔῖ

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
giz: Da ki wuɗ le ki gi slra ti "digule" ngi "beleler ngi tuh: { sc-review-form-button-approve-shortcut } ɓa ngi tiɓi, { sc-review-form-button-reject-shortcut } ɓa ngi hizik,{ sc-review-form-button-skip-shortcut } ɓa ngi tuwuɗ

source: You cannot add multiple sentences for a single submission
giz: Aƞ slin purla na, ki juɓ ɓehey haɗiye guta

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
giz: ki wini ko mi purla taˀ. Cam ar <profileLink> vidum ɗikl</profileLink> ba ngi wini mihey

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
giz: ki kiɗa mi ngi slin ar ɗerewel mi cay hana le.Anji ki kutuko { $retryLimit } tesl-tesl'hey ɓa ki tilo ɓi lumuƞ.Sise vur ɓus ɗik.

source: You must allow microphone access.
giz: Anji ki pula jivit da tulum

source: You’re contributing to a target segment
giz: kira jumom aƞ jilen/dudok ndra

source: You’re contributing to our first target segment
giz: kira jumom aƞ jilen/dudok ndra mudumbuƞ

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
giz: ki ra vusvu. Musuk vu ne ba ki zla luf na ba ki bura da naŋ celele

source: You're helping Common Voice reach our daily sentence goals!
giz: ki jina Common Voice a ndila gwat nang masupah tang tum vur hin gar ngi mingiɓi

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
giz: welelehe ngi mi kumo asa gi naƞ digule ti ngwat ma wakagar ava. Da ki wuɗam le na, ki mbuɗaka ngwataya ɓa ngi luma migiɓehey ti irne/mi kum

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
giz: welelehe ngi mi kum asa gi naƞ ti migiɓi digule. Da ki wuɗ na, ki mbuɗa ngwataya ɓa a bawa ti migiɓi mekelemey ti mi kum

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
giz: Mbele ɗik "common voce" a ndila <goalPercentage></goalPercentage> wuɗ naƞ ndirehe ngi $goalValue ja mi ngi ɓihey!

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
giz: Mbele ka "common voce" a ndila <goalPercentage></goalPercentage> wuɗ naƞ ndirehe ngi { $goalValue } tiɓihey!
